/*
	oop : 객체지향 Object Oriented Programming , 객체 단위로 실행된다.
	pop : 절차지향 Procedual Oriented Programming , 순서대로 실행된다.

*/

/*
	객체지향을 만들기 위해서는
	class : 설계도(붕어빵 틀)

	Object

	Instance : 설계도에 의해 만들어진 것(붕어빵), 객체에 포함됨. 메모리에 할당됨.

*/

/*
	객체지향의 4대 특징
	- 추상화(Abstraction) : 모델링이라고 보면 됨.
	- 캡슐화(Encapsulation) (정보은닉(Informaiotn hiding)) : 객체의 속성이나 동작 같은 것들을 클래스로 묶는 것.
		외부에 필요한 내용만 공개해서 나만의 변수들은 숨기는 것은 정보은닉(리모콘의 회로 구조는 몰라도 버튼을 통해서 사용할 수 있는 것)
	- 상속(Inheritance) : 상위, 하위 클래스가 존재(상위의 특성을 물려 받는 하위 클래스가 있어서 재사용과 확장의 의미가 있음)
	- 다형성(Polymorphism) : 하나의 객체가 여러가지 자료형을 가지고 있는 것
		ㅁ 오버로딩 : 같은 이름 함수가 여러 개 있는 데 매개변수 등의 자료형을 달리 해서 구별하는 것.
		ㅁ 오버라이딩 : 부모 클래스에서 상속 받은 것을 자식 클래스에서 재정의하는 것.

*/